# Handling missing values    (dropna and fillna)

In [12]:
import numpy as np 
import pandas as pd
import random

In [13]:
college_data = {
    'StudentID': [f'S{str(i).zfill(4)}' for i in range(1, 21)],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank', 'Grace', 'Hank', 'Ivy', 'Jack',
             'Kara', 'Liam', 'Mia', 'Nina', 'Oscar', 'Paul', 'Quinn', 'Rita', 'Steve', 'Tina'],
    'Age': [random.choice([18, 19, 20, 21, 22, np.nan]) for _ in range(20)],
    'GPA': [round(random.uniform(2.0, 4.0), 2) if random.random() > 0.2 else np.nan for _ in range(20)],
    'Major': ['CS', 'Math', 'Physics', 'Chemistry', 'Biology', 'Economics', 'History', 'Psychology', 
              'Sociology', 'Art', 'CS', 'Math', 'Physics', 'Chemistry', 'Biology', 'Economics', 
              'History', 'Psychology', 'Sociology', 'Art'],
    'AttendanceRate': [round(random.uniform(50, 100), 2) if random.random() > 0.15 else np.nan for _ in range(20)]
}

In [14]:
data = pd.DataFrame(college_data)
data

   StudentID     Name   Age   GPA       Major  AttendanceRate
0      S0001    Alice  20.0  3.22          CS           66.90
1      S0002      Bob  18.0  2.83        Math           60.40
2      S0003  Charlie  20.0  2.46     Physics           69.42
3      S0004    David  22.0   NaN   Chemistry           66.34
4      S0005      Eva  20.0  3.23     Biology           82.36
5      S0006    Frank  19.0   NaN   Economics           87.49
6      S0007    Grace   NaN  3.17     History           72.43
7      S0008     Hank  19.0  3.63  Psychology             NaN
8      S0009      Ivy  19.0  2.53   Sociology           59.13
9      S0010     Jack  18.0   NaN         Art           51.35
10     S0011     Kara  21.0  2.12          CS           57.63
11     S0012     Liam  22.0  3.45        Math           97.95
12     S0013      Mia   NaN  3.87     Physics           94.67
13     S0014     Nina   NaN  3.51   Chemistry           52.58
14     S0015    Oscar  22.0  3.62     Biology           86.91
15     S0016     Paul  19.0  3.41   Economics           89.63
16     S0017    Quinn  19.0  3.12     History           50.60
17     S0018     Rita  21.0   NaN  Psychology           78.42
18     S0019    Steve  20.0  3.79   Sociology           91.51
19     S0020     Tina   NaN   NaN         Art           65.01

In [15]:
#data.dropna() # it will remove all raws that have missing values now if want to drop all column that have nana values we havr to give axis = 1

In [16]:
data

   StudentID     Name   Age   GPA       Major  AttendanceRate
0      S0001    Alice  20.0  3.22          CS           66.90
1      S0002      Bob  18.0  2.83        Math           60.40
2      S0003  Charlie  20.0  2.46     Physics           69.42
3      S0004    David  22.0   NaN   Chemistry           66.34
4      S0005      Eva  20.0  3.23     Biology           82.36
5      S0006    Frank  19.0   NaN   Economics           87.49
6      S0007    Grace   NaN  3.17     History           72.43
7      S0008     Hank  19.0  3.63  Psychology             NaN
8      S0009      Ivy  19.0  2.53   Sociology           59.13
9      S0010     Jack  18.0   NaN         Art           51.35
10     S0011     Kara  21.0  2.12          CS           57.63
11     S0012     Liam  22.0  3.45        Math           97.95
12     S0013      Mia   NaN  3.87     Physics           94.67
13     S0014     Nina   NaN  3.51   Chemistry           52.58
14     S0015    Oscar  22.0  3.62     Biology           86.91
15     S0016     Paul  19.0  3.41   Economics           89.63
16     S0017    Quinn  19.0  3.12     History           50.60
17     S0018     Rita  21.0   NaN  Psychology           78.42
18     S0019    Steve  20.0  3.79   Sociology           91.51
19     S0020     Tina   NaN   NaN         Art           65.01

In [18]:
# if any data have all columns (row are nan) then will how how perameter   how="any" or how="all"

In [19]:
#with the help of fiilna we can fill the values in data

In [20]:
# and with the help of replace() function we can replace the values in data